STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U5x9J-DK/stm32u5x9j_discovery_hspi.c
/**
  ******************************************************************************
  * @file    stm32u5x9j_discovery_hspi.c
  * @author  MCD Application Team
  * @brief   This file includes a standard driver for the APS512XX 16bits-HSPI memory
  *          mounted on HSPI/OSPI daughter board MB1648 used with PEB3 Cobra MB1309 board.
  @verbatim
  ==============================================================================
                     ##### How to use this driver #####
  ==============================================================================
  [..]
   (#) This driver is used to drive the APS512XX 16bits-HSPI PSRAM external memory mounted on
       on HSPI/OSPI daughter board MB1648 used with PEB3 Cobra MB1309 board.

   (#) This driver need specific component driver (APS512XX) to be included with.

   (#) APS512XX Initialization steps:
       (++) Initialize the 16bits-HSPI PSRAM external memory using the BSP_HSPI_RAM_Init() function. This
            function includes the MSP layer hardware resources initialization and the
            HSPI interface with the external memory.

   (#) APS512XX 16bits-HSPI PSRAM memory operations
       (++) 16bits-HSPI PSRAM memory can be accessed with read/write operations once it is
            initialized.
            Read/write operation can be performed with AHB access using the functions
            BSP_HSPI_RAM_Read()/BSP_HSPI_RAM_Write().
            Read/write operation can be performed with DMA using the functions
            BSP_HSPI_RAM_Read_DMA()/BSP_HSPI_RAM_Write_DMA().
       (++) The memory access can be configured in memory-mapped mode with the call of
            function BSP_HSPI_RAM_EnableMemoryMapped(). To go back in indirect mode, the
            function BSP_HSPI_RAM_DisableMemoryMapped() should be used.
       (++) It is possible to put the memory in deep power-down mode to reduce its consumption.
            For this, the function BSP_HSPI_RAM_EnterDeepPowerDown() should be called. To leave
            the deep power-down mode, the function BSP_HSPI_RAM_LeaveDeepPowerDown() should be called.
       (++) The configuration of the interface between peripheral and memory is done by
            the function BSP_HSPI_RAM_Config16bitsRAM() :
            - two latency types are possible :
              - Fixed latency
              - Variable latency
            - five latency codes are possible (for read and write) :
              - 3 latency clocks
              - 4 latency clocks
              - 5 latency clocks
              - 6 latency clocks
              - 7 latency clocks
            - four burst configuration are possible :
              - Linear burst access
              - 16-bytes hybrid burst access
              - 32-bytes hybrid burst access
              - 64-bytes hybrid burst access
            - two IO modes are possible :
              - IO x8 mode
              - IO x16 mode

  @endverbatim
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32u5x9j_discovery_hspi.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32U5x9J_DISCOVERY
  * @{
  */

/** @defgroup STM32U5x9J_DISCOVERY_HSPI HSPI
  * @{
  */

/* Exported variables --------------------------------------------------------*/
/** @addtogroup STM32U5x9J_DISCOVERY_HSPI_RAM_Exported_Variables
  * @{
  */
XSPI_HandleTypeDef hhspi_ram[HSPI_RAM_INSTANCES_NUMBER] = {0};
HSPI_RAM_Ctx_t Hspi_Ram_Ctx[HSPI_RAM_INSTANCES_NUMBER] = {{
    HSPI_ACCESS_NONE,
    BSP_HSPI_RAM_VARIABLE_LATENCY,
    DEFAULT_READ_LATENCY_CODE,
    DEFAULT_WRITE_LATENCY_CODE,
    BSP_HSPI_RAM_HYBRID_BURST,
    BSP_HSPI_RAM_BURST_32_BYTES,
    BSP_HSPI_RAM_IO_X8_MODE
  }
};
/**
  * @}
  */

/* Private constants --------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/** @defgroup STM32U5x9J_DISCOVERY_HSPI_RAM_Private_Variables HSPI_RAM Private Variables
  * @{
  */
#if (USE_HAL_XSPI_REGISTER_CALLBACKS == 1)
static uint32_t HspiRam_IsMspCbValid[HSPI_RAM_INSTANCES_NUMBER] = {0};
#endif /* USE_HAL_XSPI_REGISTER_CALLBACKS */
/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/

/** @defgroup STM32U5x9J_DISCOVERY_HSPI_RAM_Private_Functions HSPI_RAM Private Functions
  * @{
  */
static void HSPI_RAM_MspInit(XSPI_HandleTypeDef *hhspi);
static void HSPI_RAM_MspDeInit(const XSPI_HandleTypeDef *hhspi);
static int32_t Tuning_HSPI_Write(XSPI_HandleTypeDef *hhspi);
static int32_t Tuning_HSPI_Read(XSPI_HandleTypeDef *hhspi);

/**
  * @}
  */

/* Exported functions ---------------------------------------------------------*/

/** @addtogroup STM32U5x9J_DISCOVERY_HSPI_RAM_Exported_Functions
  * @{
  */

/**
  * @brief  Initializes the HSPI interface.
  * @param  Instance   HSPI Instance
  * @param  Init       HSPI Init structure
  * @retval BSP status
  */
int32_t BSP_HSPI_RAM_Init(uint32_t Instance, BSP_HSPI_RAM_Cfg_t *Init)
{
  int32_t ret;
  MX_HSPI_InitTypeDef hspi_init;

  /* Check if the instance is supported */
  if (Instance >= HSPI_RAM_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Check if the instance is already initialized */
    if (Hspi_Ram_Ctx[Instance].IsInitialized == HSPI_ACCESS_NONE)
    {
#if (USE_HAL_XSPI_REGISTER_CALLBACKS == 0)
      /* Msp HSPI initialization */
      HSPI_RAM_MspInit(&hhspi_ram[Instance]);
#else
      /* Register the HSPI MSP Callbacks */
      if (HspiRam_IsMspCbValid[Instance] == 0UL)
      {
        if (BSP_HSPI_RAM_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
        {
          return BSP_ERROR_PERIPH_FAILURE;
        }
      }
#endif /* USE_HAL_XSPI_REGISTER_CALLBACKS */

      /* Fill config structure */
      hspi_init.ClockPrescaler = 0; /* HSPI clock = 160MHz / ClockPrescaler = 160MHz */
      hspi_init.MemorySize     = (uint32_t)POSITION_VAL(APS512XX_RAM_SIZE);
      hspi_init.SampleShifting = HAL_XSPI_SAMPLE_SHIFT_NONE;

      /* STM32 HSPI interface initialization */
      if (MX_HSPI_RAM_Init(&hhspi_ram[Instance], &hspi_init) != HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
      /* Reset the memory */
      else if (APS512XX_Reset(&hhspi_ram[Instance]) != 0)/*APS512XX_OK*/
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      /* Configure the memory */
      else if (BSP_HSPI_RAM_Config16BitsOctalRAM(Instance, Init) != BSP_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      else
      {
        Hspi_Ram_Ctx[Instance].IsInitialized = HSPI_ACCESS_INDIRECT;
        ret = BSP_ERROR_NONE;
      }
    }
    else
    {
      ret = BSP_ERROR_NONE;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  De-Initializes the HSPI interface.
  * @param  Instance   HSPI Instance
  * @retval BSP status
  */
int32_t BSP_HSPI_RAM_DeInit(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

