STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U5x9J-DK/stm32u5x9j_discovery_hspi.c
  /* Check if the instance is supported */
  if (Instance >= HSPI_RAM_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Check if the instance is already initialized */
    if (Hspi_Ram_Ctx[Instance].IsInitialized != HSPI_ACCESS_NONE)
    {
      /* Disable Memory mapped mode */
      if (Hspi_Ram_Ctx[Instance].IsInitialized == HSPI_ACCESS_MMP)
      {
        if (BSP_HSPI_RAM_DisableMemoryMappedMode(Instance) != BSP_ERROR_NONE)
        {
          return BSP_ERROR_COMPONENT_FAILURE;
        }
      }

      /* Set default Hspi_Ram_Ctx values */
      Hspi_Ram_Ctx[Instance].IsInitialized    = HSPI_ACCESS_NONE;
      Hspi_Ram_Ctx[Instance].LatencyType      = BSP_HSPI_RAM_VARIABLE_LATENCY;
      Hspi_Ram_Ctx[Instance].ReadLatencyCode  = DEFAULT_READ_LATENCY_CODE;
      Hspi_Ram_Ctx[Instance].WriteLatencyCode = DEFAULT_WRITE_LATENCY_CODE;
      Hspi_Ram_Ctx[Instance].BurstType        = BSP_HSPI_RAM_HYBRID_BURST;
      Hspi_Ram_Ctx[Instance].BurstLength      = BSP_HSPI_RAM_BURST_32_BYTES;
      Hspi_Ram_Ctx[Instance].IOMode           = BSP_HSPI_RAM_IO_X8_MODE;

#if (USE_HAL_XSPI_REGISTER_CALLBACKS == 0)
      HSPI_RAM_MspDeInit(&hhspi_ram[Instance]);
#endif /* (USE_HAL_XSPI_REGISTER_CALLBACKS == 0) */

      /* Call the DeInit function to reset the driver */
      if (HAL_XSPI_DeInit(&hhspi_ram[Instance]) != HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Tuning the HSPI write.
  * @param  hhspi          HSPI handle
  * @retval BSP status
  */
static int32_t Tuning_HSPI_Write(XSPI_HandleTypeDef *hhspi)
{
  int32_t ret = BSP_ERROR_NONE;
  XSPI_HSCalTypeDef sCfg;

  hhspi->Instance = HSPI1;
  hhspi->State    = HAL_XSPI_STATE_READY;

  sCfg.DelayValueType        = HAL_XSPI_CAL_DATA_OUTPUT_DELAY;
  sCfg.FineCalibrationUnit   = 0x11;
  sCfg.CoarseCalibrationUnit = 0x05;
  sCfg.MaxCalibration        = HAL_XSPI_MAXCAL_REACHED;
  if (HAL_XSPI_SetDelayValue(hhspi, &sCfg) != HAL_OK)
  {
    if (hhspi->Instance == HSPI1)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Tuning the HSPI Read.
  * @param  hhspi          HSPI handle
  * @retval BSP status
  */
static int32_t Tuning_HSPI_Read(XSPI_HandleTypeDef *hhspi)
{
  int32_t ret = BSP_ERROR_NONE;
  XSPI_HSCalTypeDef sCfg;

  hhspi->Instance = HSPI1;
  hhspi->State    = HAL_XSPI_STATE_READY;

  sCfg.DelayValueType        = HAL_XSPI_CAL_DQS_INPUT_DELAY;
  sCfg.FineCalibrationUnit   = 0x11;
  sCfg.CoarseCalibrationUnit = 0x05;
  sCfg.MaxCalibration        = HAL_XSPI_MAXCAL_NOT_REACHED;

  if (HAL_XSPI_SetDelayValue(hhspi, &sCfg) != HAL_OK)
  {
    if (hhspi->Instance == HSPI1)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
  }

  /* Return BSP status */
  return ret;
}


/**
  * @brief  Initializes the HSPI interface.
  * @param  hhspi          HSPI handle
  * @param  Init           HSPI config structure
  * @retval BSP status
  */
__weak HAL_StatusTypeDef MX_HSPI_RAM_Init(XSPI_HandleTypeDef *hhspi, MX_HSPI_InitTypeDef *Init)
{
  HAL_StatusTypeDef status;
  uint32_t hspi_clk = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_HSPI);

  /* HSPI initialization */
  hhspi->Instance = HSPI1;

  hhspi->Init.FifoThresholdByte       = 2U;
  hhspi->Init.MemoryMode              = HAL_XSPI_SINGLE_MEM;
  hhspi->Init.MemoryType              = HAL_XSPI_MEMTYPE_APMEM_16BITS;
  hhspi->Init.MemorySize              = Init->MemorySize;
  hhspi->Init.ChipSelectHighTimeCycle = 1U;
  hhspi->Init.FreeRunningClock        = HAL_XSPI_FREERUNCLK_DISABLE;
  hhspi->Init.ClockMode               = HAL_XSPI_CLOCK_MODE_0;
  hhspi->Init.WrapSize                = HAL_XSPI_WRAP_32_BYTES;
  hhspi->Init.ClockPrescaler          = Init->ClockPrescaler;
  hhspi->Init.SampleShifting          = Init->SampleShifting;
  hhspi->Init.DelayHoldQuarterCycle   = HAL_XSPI_DHQC_DISABLE;
  hhspi->Init.ChipSelectBoundary      = 11U;
  hhspi->Init.DelayBlockBypass        = HAL_XSPI_DELAY_BLOCK_ON;
  /* tCEM = 2 us max => REFRESH+4 clock cycles for read */
  hhspi->Init.Refresh                 = ((2U * (hspi_clk / (Init->ClockPrescaler + 1U))) / 1000000U) - 4U;
  hhspi->Init.MaxTran                 = 0U;

  status = HAL_XSPI_Init(hhspi);

  return status;
}

#if (USE_HAL_XSPI_REGISTER_CALLBACKS == 1)
/**
  * @brief Default BSP HSPI Msp Callbacks
  * @param Instance      HSPI Instance
  * @retval BSP status
  */
int32_t BSP_HSPI_RAM_RegisterDefaultMspCallbacks(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if (Instance >= HSPI_RAM_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Register MspInit/MspDeInit Callbacks */
    if (HAL_XSPI_RegisterCallback(&hhspi_ram[Instance], HAL_XSPI_MSP_INIT_CB_ID, HSPI_RAM_MspInit) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if (HAL_XSPI_RegisterCallback(&hhspi_ram[Instance], HAL_XSPI_MSP_DEINIT_CB_ID, HSPI_RAM_MspDeInit) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      HspiRam_IsMspCbValid[Instance] = 1U;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief BSP HSPI Msp Callback registering
  * @param Instance     HSPI Instance
  * @param CallBacks    pointer to MspInit/MspDeInit callbacks functions
  * @retval BSP status
  */
int32_t BSP_HSPI_RAM_RegisterMspCallbacks(uint32_t Instance, BSP_HSPI_Cb_t *CallBacks)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if (Instance >= HSPI_RAM_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Register MspInit/MspDeInit Callbacks */
    if (HAL_XSPI_RegisterCallback(&hhspi_ram[Instance], HAL_XSPI_MSP_INIT_CB_ID, CallBacks->pMspInitCb) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if (HAL_XSPI_RegisterCallback(&hhspi_ram[Instance], HAL_XSPI_MSP_DEINIT_CB_ID,
                                       CallBacks->pMspDeInitCb) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      HspiRam_IsMspCbValid[Instance] = 1U;
    }
  }

  /* Return BSP status */
  return ret;
}
#endif /* (USE_HAL_XSPI_REGISTER_CALLBACKS == 1) */

/**
  * @brief  Reads an amount of data from the 16-bits Octal RAM memory.
  * @param  Instance  HSPI instance
  * @param  pData     Pointer to data to be read
  * @param  ReadAddr  Read start address
  * @param  Size      Size of data to read
  * @retval BSP status
  */
int32_t BSP_HSPI_RAM_Read(uint32_t Instance, uint8_t *pData, uint32_t ReadAddr, uint32_t Size)
{
  int32_t ret;

