STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U5x9J-DK/stm32u5x9j_discovery_hspi.c
  /* Check if the instance is supported */
  if (Instance >= HSPI_RAM_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if (APS512XX_EnterPowerDown(&hhspi_ram[Instance]) != APS512XX_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    /* ---         Memory enter deep power down as soon nCS goes high        --- */
    /* --- At least 500us should be respected before leaving deep power down --- */

    ret = BSP_ERROR_NONE;
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  This function leave the 16-bits Octal RAM memory from deep power down mode.
  * @param  Instance  HSPI instance
  * @retval BSP status
  */
int32_t BSP_HSPI_RAM_LeaveDeepPowerDown(uint32_t Instance)
{
  int32_t ret;

  /* Check if the instance is supported */
  if (Instance >= HSPI_RAM_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if (APS512XX_LeavePowerDown(&hhspi_ram[Instance]) != APS512XX_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    /* --- A dummy command is sent to the memory, as the nCS should be low for at least 60 ns  --- */
    /* ---                  Memory takes 150us max to leave deep power down                    --- */

    ret = BSP_ERROR_NONE;
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Handles HSPI 16-bits Octal RAM DMA transfer interrupt request.
  * @param  Instance HSPI instance
  * @retval None
  */
void BSP_HSPI_RAM_DMA_IRQHandler(uint32_t Instance)
{
  HAL_DMA_IRQHandler(hhspi_ram[Instance].hdmatx);
  HAL_DMA_IRQHandler(hhspi_ram[Instance].hdmarx);
}

/**
  * @brief  Handles HSPI 16-bits Octal RAM interrupt request.
  * @param  Instance HSPI instance
  * @retval None
  */
void BSP_HSPI_RAM_IRQHandler(uint32_t Instance)
{
  HAL_XSPI_IRQHandler(&hhspi_ram[Instance]);
}
/**
  * @}
  */

/** @addtogroup STM32U5x9J_DISCOVERY_HSPI_RAM_Private_Functions
  * @{
  */

/**
  * @brief  Initializes the HSPI MSP.
  * @param  hhspi HSPI handle
  * @retval None
  */
static void HSPI_RAM_MspInit(XSPI_HandleTypeDef *hhspi)
{
  static DMA_HandleTypeDef hdmatx, hdmarx;
  GPIO_InitTypeDef GPIO_InitStruct;

  __HAL_RCC_PWR_CLK_ENABLE();
  SET_BIT(PWR->SVMCR, PWR_SVMCR_IO2SV);

  /* Enable the HSPI memory interface, DMA and GPIO clocks */
  HSPI_CLK_ENABLE();
  HSPI_RAM_DMAx_CLK_ENABLE();
  HSPI_CLK_GPIO_CLK_ENABLE();
  HSPI_DQS0_GPIO_CLK_ENABLE();
  HSPI_DQS1_GPIO_CLK_ENABLE();
  HSPI_CS_GPIO_CLK_ENABLE();
  HSPI_D0_GPIO_CLK_ENABLE();
  HSPI_D1_GPIO_CLK_ENABLE();
  HSPI_D2_GPIO_CLK_ENABLE();
  HSPI_D3_GPIO_CLK_ENABLE();
  HSPI_D4_GPIO_CLK_ENABLE();
  HSPI_D5_GPIO_CLK_ENABLE();
  HSPI_D6_GPIO_CLK_ENABLE();
  HSPI_D7_GPIO_CLK_ENABLE();
  HSPI_D8_GPIO_CLK_ENABLE();
  HSPI_D9_GPIO_CLK_ENABLE();
  HSPI_D10_GPIO_CLK_ENABLE();
  HSPI_D11_GPIO_CLK_ENABLE();
  HSPI_D12_GPIO_CLK_ENABLE();
  HSPI_D13_GPIO_CLK_ENABLE();
  HSPI_D14_GPIO_CLK_ENABLE();
  HSPI_D15_GPIO_CLK_ENABLE();

  /*  Activate HSLV  */
  HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_CS_GPIO_PORT, HSPI_CS_PIN);
  HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_DQS0_GPIO_PORT, HSPI_DQS0_PIN);
  HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_DQS1_GPIO_PORT, HSPI_DQS1_PIN);
  HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_CLK_GPIO_PORT, HSPI_CLK_PIN);
  HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_NCLK_GPIO_PORT, HSPI_NCLK_PIN);

  HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D0_GPIO_PORT, HSPI_D0_PIN);
  HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D1_GPIO_PORT, HSPI_D1_PIN);
  HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D2_GPIO_PORT, HSPI_D2_PIN);
  HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D3_GPIO_PORT, HSPI_D3_PIN);
  HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D4_GPIO_PORT, HSPI_D4_PIN);
  HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D5_GPIO_PORT, HSPI_D5_PIN);
  HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D6_GPIO_PORT, HSPI_D6_PIN);
  HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D7_GPIO_PORT, HSPI_D7_PIN);

  HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D8_GPIO_PORT, HSPI_D8_PIN);
  HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D9_GPIO_PORT, HSPI_D9_PIN);
  HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D10_GPIO_PORT, HSPI_D10_PIN);
  HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D11_GPIO_PORT, HSPI_D11_PIN);
  HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D12_GPIO_PORT, HSPI_D12_PIN);
  HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D13_GPIO_PORT, HSPI_D13_PIN);
  HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D14_GPIO_PORT, HSPI_D14_PIN);
  HAL_GPIO_EnableHighSPeedLowVoltage(HSPI_D15_GPIO_PORT, HSPI_D15_PIN);

  /* Reset the HSPI memory interface */
  HSPI_FORCE_RESET();
  HSPI_RELEASE_RESET();

  /* HSPI CS GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_CS_PIN;
  GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull      = GPIO_NOPULL;
  GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStruct.Alternate = HSPI_CS_PIN_AF;
  HAL_GPIO_Init(HSPI_CS_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI DQS0 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_DQS0_PIN;
  GPIO_InitStruct.Alternate = HSPI_DQS0_PIN_AF;
  HAL_GPIO_Init(HSPI_DQS0_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI DQS1 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_DQS1_PIN;
  GPIO_InitStruct.Alternate = HSPI_DQS1_PIN_AF;
  HAL_GPIO_Init(HSPI_DQS1_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI CLK GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_CLK_PIN;
  GPIO_InitStruct.Alternate = HSPI_CLK_PIN_AF;
  HAL_GPIO_Init(HSPI_CLK_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI D0 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_D0_PIN;
  GPIO_InitStruct.Alternate = HSPI_D0_PIN_AF;
  HAL_GPIO_Init(HSPI_D0_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI D1 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_D1_PIN;
  GPIO_InitStruct.Alternate = HSPI_D1_PIN_AF;
  HAL_GPIO_Init(HSPI_D1_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI D2 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_D2_PIN;
  GPIO_InitStruct.Alternate = HSPI_D2_PIN_AF;
  HAL_GPIO_Init(HSPI_D2_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI D3 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_D3_PIN;
  GPIO_InitStruct.Alternate = HSPI_D3_PIN_AF;
  HAL_GPIO_Init(HSPI_D3_GPIO_PORT, &GPIO_InitStruct);

