STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U5x9J-DK/stm32u5x9j_discovery_hspi.c
  /* HSPI D4 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_D4_PIN;
  GPIO_InitStruct.Alternate = HSPI_D4_PIN_AF;
  HAL_GPIO_Init(HSPI_D4_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI D5 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_D5_PIN;
  GPIO_InitStruct.Alternate = HSPI_D5_PIN_AF;
  HAL_GPIO_Init(HSPI_D5_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI D6 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_D6_PIN;
  GPIO_InitStruct.Alternate = HSPI_D6_PIN_AF;
  HAL_GPIO_Init(HSPI_D6_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI D7 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_D7_PIN;
  GPIO_InitStruct.Alternate = HSPI_D7_PIN_AF;
  HAL_GPIO_Init(HSPI_D7_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI D8 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_D8_PIN;
  GPIO_InitStruct.Alternate = HSPI_D8_PIN_AF;
  HAL_GPIO_Init(HSPI_D8_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI D9 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_D9_PIN;
  GPIO_InitStruct.Alternate = HSPI_D9_PIN_AF;
  HAL_GPIO_Init(HSPI_D9_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI D10 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_D10_PIN;
  GPIO_InitStruct.Alternate = HSPI_D10_PIN_AF;
  HAL_GPIO_Init(HSPI_D10_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI D11 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_D11_PIN;
  GPIO_InitStruct.Alternate = HSPI_D11_PIN_AF;
  HAL_GPIO_Init(HSPI_D11_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI D12 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_D12_PIN;
  GPIO_InitStruct.Alternate = HSPI_D12_PIN_AF;
  HAL_GPIO_Init(HSPI_D12_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI D13 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_D13_PIN;
  GPIO_InitStruct.Alternate = HSPI_D13_PIN_AF;
  HAL_GPIO_Init(HSPI_D13_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI D14 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_D14_PIN;
  GPIO_InitStruct.Alternate = HSPI_D14_PIN_AF;
  HAL_GPIO_Init(HSPI_D14_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI D15 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_D15_PIN;
  GPIO_InitStruct.Alternate = HSPI_D15_PIN_AF;
  HAL_GPIO_Init(HSPI_D15_GPIO_PORT, &GPIO_InitStruct);

  hdmatx.Init.Request = GPDMA1_REQUEST_HSPI1;
  hdmatx.Instance = GPDMA1_Channel12;
  HAL_NVIC_SetPriority(GPDMA1_Channel12_IRQn, 0x00, 0);
  HAL_NVIC_EnableIRQ(GPDMA1_Channel12_IRQn);

  /* Configure the HSPI DMA transmit */
  hdmatx.Init.Direction           = DMA_MEMORY_TO_PERIPH;
  hdmatx.Init.SrcInc              = DMA_SINC_INCREMENTED;
  hdmatx.Init.DestInc             = DMA_DINC_FIXED;
  hdmatx.Init.Priority            = DMA_HIGH_PRIORITY;
  hdmatx.Init.SrcBurstLength      = 1;
  hdmatx.Init.DestBurstLength     = 1;
  hdmatx.Init.TransferEventMode   = DMA_TCEM_BLOCK_TRANSFER;
  hdmatx.Init.SrcDataWidth        = DMA_SRC_DATAWIDTH_WORD ;
  hdmatx.Init.DestDataWidth       = DMA_DEST_DATAWIDTH_WORD  ;

  /* Enable the GPDMA clock */
  __HAL_RCC_GPDMA1_CLK_ENABLE();

  __HAL_LINKDMA(hhspi, hdmatx, hdmatx);

  /* Initialize the DMA channel */
  (void)HAL_DMA_Init(&hdmatx);

  hdmarx.Init.Request = GPDMA1_REQUEST_HSPI1;
  hdmarx.Instance = GPDMA1_Channel7;
  HAL_NVIC_SetPriority(GPDMA1_Channel7_IRQn, 0x00, 0);
  HAL_NVIC_EnableIRQ(GPDMA1_Channel7_IRQn);

  /* Configure the HSPI DMA receive */
  hdmarx.Init.Direction           = DMA_PERIPH_TO_MEMORY;
  hdmarx.Init.SrcInc              = DMA_SINC_FIXED;
  hdmarx.Init.DestInc             = DMA_DINC_INCREMENTED;
  hdmarx.Init.Priority            = DMA_HIGH_PRIORITY;
  hdmarx.Init.SrcBurstLength      = 1;
  hdmarx.Init.DestBurstLength     = 1;
  hdmarx.Init.TransferEventMode   = DMA_TCEM_BLOCK_TRANSFER;
  hdmarx.Init.SrcDataWidth        = DMA_SRC_DATAWIDTH_WORD ;
  hdmarx.Init.DestDataWidth       = DMA_DEST_DATAWIDTH_WORD  ;

  /* Enable the GPDMA clock */
  __HAL_RCC_GPDMA1_CLK_ENABLE();

  __HAL_LINKDMA(hhspi, hdmarx, hdmarx);

  /* Initialize the DMA channel */
  (void)HAL_DMA_Init(&hdmarx);

  /* Enable and set priority of the HSPI and DMA interrupts */
  HAL_NVIC_SetPriority(HSPI1_IRQn, BSP_HSPI_RAM_IT_PRIORITY, 0);
  HAL_NVIC_SetPriority(HSPI_RAM_DMAx_IRQn, BSP_HSPI_RAM_DMA_IT_PRIORITY, 0);

  HAL_NVIC_EnableIRQ(HSPI1_IRQn);
  HAL_NVIC_EnableIRQ(HSPI_RAM_DMAx_IRQn);
}

/**
  * @brief  De-Initializes the HSPI MSP.
  * @param  hhspi HSPI handle
  * @retval None
  */
static void HSPI_RAM_MspDeInit(const XSPI_HandleTypeDef *hhspi)
{
  static DMA_HandleTypeDef dma_handle;

  /* hhspi unused argument(s) compilation warning */
  UNUSED(hhspi);

  /* Disable DMA and HSPI interrupts */
  HAL_NVIC_DisableIRQ(HSPI_RAM_DMAx_IRQn);
  HAL_NVIC_DisableIRQ(HSPI1_IRQn);

  /* De-configure the HSPI DMA */
  dma_handle.Instance = HSPI_RAM_DMAx_CHANNEL;
  (void) HAL_DMA_DeInit(&dma_handle);

  /* HSPI GPIO pins de-configuration  */
  HAL_GPIO_DeInit(HSPI_CLK_GPIO_PORT, HSPI_CLK_PIN);
  HAL_GPIO_DeInit(HSPI_NCLK_GPIO_PORT, HSPI_NCLK_PIN);
  HAL_GPIO_DeInit(HSPI_DQS0_GPIO_PORT, HSPI_DQS0_PIN);
  HAL_GPIO_DeInit(HSPI_DQS1_GPIO_PORT, HSPI_DQS1_PIN);
  HAL_GPIO_DeInit(HSPI_CS_GPIO_PORT, HSPI_CS_PIN);
  HAL_GPIO_DeInit(HSPI_D0_GPIO_PORT, HSPI_D0_PIN);
  HAL_GPIO_DeInit(HSPI_D1_GPIO_PORT, HSPI_D1_PIN);
  HAL_GPIO_DeInit(HSPI_D2_GPIO_PORT, HSPI_D2_PIN);
  HAL_GPIO_DeInit(HSPI_D3_GPIO_PORT, HSPI_D3_PIN);
  HAL_GPIO_DeInit(HSPI_D4_GPIO_PORT, HSPI_D4_PIN);
  HAL_GPIO_DeInit(HSPI_D5_GPIO_PORT, HSPI_D5_PIN);
  HAL_GPIO_DeInit(HSPI_D6_GPIO_PORT, HSPI_D6_PIN);
  HAL_GPIO_DeInit(HSPI_D7_GPIO_PORT, HSPI_D7_PIN);
  HAL_GPIO_DeInit(HSPI_D8_GPIO_PORT, HSPI_D8_PIN);
  HAL_GPIO_DeInit(HSPI_D9_GPIO_PORT, HSPI_D9_PIN);
  HAL_GPIO_DeInit(HSPI_D10_GPIO_PORT, HSPI_D10_PIN);
  HAL_GPIO_DeInit(HSPI_D11_GPIO_PORT, HSPI_D11_PIN);
  HAL_GPIO_DeInit(HSPI_D12_GPIO_PORT, HSPI_D12_PIN);
  HAL_GPIO_DeInit(HSPI_D13_GPIO_PORT, HSPI_D13_PIN);
  HAL_GPIO_DeInit(HSPI_D14_GPIO_PORT, HSPI_D14_PIN);
  HAL_GPIO_DeInit(HSPI_D15_GPIO_PORT, HSPI_D15_PIN);

  /* Reset the HSPI memory interface */
  HSPI_FORCE_RESET();
  HSPI_RELEASE_RESET();

  /* Disable the HSPI memory interface clock */
  HSPI_CLK_DISABLE();
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
